Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: A transformed shape, based on its matrix values.
ja: 変換された形状、それの行列値に基づいて。

source: A transition from transparent to opaque on insertion, and from opaque to transparent on removal.
ja: 挿入において透明から不透明への、そして除去において不透明から透明への遷移。

source: A transition that returns the input view, unmodified, as the output view.
ja: ある遷移、それは入力ビューを、修正せずに、出力ビューのように返します。

source: A type for animating views.
ja: アニメーションビューに対する型。

source: A type of object with a publisher that emits before the object has changed.
ja: パブリッシャーをもつオブジェクトのある型、それはそのオブジェクトが変化してしまう前に発布します。

source: A type of view that generates views from an underlying collection of data.
ja: ビューのある型、それはある基礎をなすデータのコレクションからビューそれらを生成するものです。

source: A type that applies custom interaction behavior and a custom appearance to all buttons within a view hierarchy.
ja: ある型、それはあつらえの相互作用挙動とあつらえの外観をビュー階層内の全てのボタンに適用するものです。

source: A type that applies standard interaction behavior and a custom appearance to all buttons within a view hierarchy.
ja: ある型、それは標準相互作用挙動とあつらえの外観をビュー階層内の全てのボタンに適用するものです。

source: A type that can serve as the animatable data of an animatable type.
ja: ある型、それはアニメーション可能型のアニメーション可能データとしての用をなすものです。

source: A type that conforms to the DropDelegate protocol.
ja: ある型、それはDropDelegateプロトコルに準拠するものです。

source: A type that describes the created views and their behavior.
ja: ある型、それは作成されたビューそれらとそれらの挙動を記述します。

source: A type that describes the scroll view’s behavior and its content.
ja: ある型、それはスクロールビューのもつ挙動とそれの内容を記述します。

source: A type that describes the value of a tap gesture.
ja: ある型、それはタップゼスチャの値を記述します。

source: A type that produces view previews in Xcode.
ja: ある型、それはビュープレビューをXcodeにおいて生み出すものです。

source: A type that represents part of your app’s user interface and provides modifiers that you use to configure views.
ja: ある型、それはあなたのアプリのもつユーザインターフェイスの一部を表します、そしてあなたがビューを構成設定するのに使う修飾子を提供します。

source: A type that represents the drag gesture and its behavior.
ja: ある型、それはドラッグジェスチャおよびそれの挙動を表します。

source: A type that represents the exclusive gesture and its behavior.
ja: ある型、それは排他的ジェスチャとそれの挙動を表すものです。

source: A type that represents the gesture and its behavior.
ja: ある型、それはジェスチャとそれの挙動を表します。

source: A type that represents the horizontal stack’s behavior and its content.
ja: ある型、それはスタックのもつ水平の挙動とそれの内容を表します。

source: A type that represents the list’s behavior and content.
ja: ある型、それはリストのもつ挙動と内容を表します。

source: A type that represents the long-press gesture and its behavior.
ja: ある型、それは長押しゼスチャとそれの挙動を表します。

source: A type that represents the magnification gesture and its behavior.
ja: ある型、それは拡大ジェスチャおよびそれの挙動を表します。

source: A type that represents the rotation gesture and its behavior.
ja: ある型、それは回転ジェスチャおよびそれの挙動を表します。

source: A type that represents the sequence gesture and its behavior.
ja: ある型、それは連続ジェスチャとそれの挙動を表します。

source: A type that represents the simultaneous gesture and its behavior.
ja: ある型、それは同時のジェスチャとそれの挙動を表します。

source: A type that represents the stack’s behavior and its content.
ja: ある型、それはスタックのもつ挙動とそれの内容を表します。

source: A type that represents the structure and behavior of an app.
ja: ある型、それはあるアプリの構造と挙動を表します。

source: A type that represents the tap gesture and its behavior.
ja: ある型、それはタップジェスチャおよびそれの挙動を表します。

source: A type that represents the updating gesture and its behavior.
ja: ある型、それは更新ジェスチャとそれの挙動を表します。

source: A type that represents the vertical stack’s behavior and its content.
ja: ある型、それはスタックのもつ垂直の挙動とそれの内容を表します。

source: A type that specifies the appearance and interaction of all pickers within a view hierarchy.
ja: ある型、それはあるビュー階層内の全てのピッカーの外観と相互作用を指定するものです。

source: A type that specifies the appearance and interaction of all toggles within a view hierarchy.
ja: ある型、それはあるビュー階層内の全てのトグルの外観と相互作用を指定するものです。

source: A type to coordinate with the WatchKit interface object.
ja: WatchKitインターフェイスオブジェクトと協調するある型。

source: A type to coordinate with the view controller.
ja: ビューコントローラと協調するある型。

source: A type to coordinate with the view.
ja: ビューと協調するある型。

source: A type-erased View.
ja: ある型消去View。

source: A type-erased geometry value that produces an anchored value of a given type.
ja: ある型消去幾何学値、それは与えられた型のあるアンカー値を生成します。

source: A type-erased gesture.
ja: 型消去ジェスチャ。

source: A type-erased label of a button.
ja: ボタンの型消去ラベル。

source: A type-erased transition.
ja: 型消去遷移。

source: A unit-space rectangle defining how much of the source image to draw.
ja: どのくらいソース画像を描画するか定義している単位空間矩形。

source: A valid index of the array.
ja: この配列の有効なインデックス。

source: A valid index of the collection to use as a limit.
ja: 限度として使うためのコレクションの有効なインデックス。

source: A valid index of the collection.
ja: コレクションのひとつの有効なインデックス。

source: A value between 0 (fully transparent) and 1 (fully opaque).
ja: ０（完全に透明）と１（完全に不透明）の間の値。

source: A value between 0 (no effect) and 1 (full white brightening) that represents the intensity of the brightness effect.
ja: ０（影響なし）と１（完全に白く輝く）の間のある値、それは輝度効果の強さを表します。

source: A value describing the addition of the given views to the beginning of the indicated group.
ja: 与えられたビューそれらのこの指し示されたグループの冒頭への追加を記述しているある値。

source: A value describing the addition of the given views to the end of the indicated group.
ja: 与えられたビューそれらのこの指し示されたグループの末尾への追加を記述しているある値。

source: A value describing the complete replacement of the contents of the indicated group with the given views.
ja: 指し示されたグループの内容のこの与えられたビューとの完全な置き換えを記述しているある値。

source: A value indicating that a requested item couldn’t be found or doesn’t exist.
ja: 要求された項目が見つけられなかったまたは存在しないことを指し示す値。

source: A value less than or equal to the number of elements in the collection.
ja: このコレクションの中の要素の数より少ないか等しい値。

source: A value less than or equal to the number of elements in the sequence, calculated nondestructively.
ja: シーケンスの中の要素数より少ないか等しい値、非破壊的に計算されます。

source: A value of 0 scales the shape to have no size, 0.5 scales to half size in both dimensions, 2 scales to twice the regular size, and so on.
ja: 0の値は形状を縮尺して大きさを持たないようにします、0.5は両方の次元において半分の大きさに縮尺します、2は普通の大きさの倍にします、などなど。

source: A value of nil will use the user default store from the environment.
ja: nilの値は、その環境からのuser default storeを使います。

source: A value of NSKeyValueChange.insertion, NSKeyValueChange.removal, or NSKeyValueChange.replacement indicates that mutating messages have been sent a key-value observing compliant collection proxy, or that one of the key-value-coding-compliant collection mutation methods for the key has been invoked, or a collection will change or did change method has been otherwise been invoked.
ja: NSKeyValueChange.insertion、NSKeyValueChange.removal、またはNSKeyValueChange.replacementの値が指し示すのは、可変メッセージがキー値監視準拠コレクションプロキシに送信されたこと、またはキーに対するキー値コーディング準拠のコレクション変更メソッドの１つが発動されたこと、またはコレクションwill changeまたはdid changeメソッドがさもなければ発動されたことです。

source: A value of NSKeyValueChange.setting indicates that the observed object has received a setValue(_:forKey:) message, or that the key-value-coding-compliant set method for the key has been invoked, or that one of the willChangeValue(forKey:) or didChangeValue(forKey:) methods has otherwise been invoked.
ja: NSKeyValueChange.settingの値が指し示すのは、監視されたオブジェクトがsetValue(_:forKey:)メッセージを受け取ったこと、またはそのキーに対するキー値コーディング準拠の設定メソッドが発動されたこと、またはwillChangeValue(forKey:)もしくはdidChangeValue(forKey:)メソッドがさもなくば発動されたことです。

source: A value of NSKeyValueChangeInsertion, NSKeyValueChangeRemoval, or NSKeyValueChangeReplacement indicates that mutating messages have been sent a key-value observing compliant collection proxy, or that one of the key-value-coding-compliant collection mutation methods for the key has been invoked, or a collection will change or did change method has been otherwise been invoked.
ja: NSKeyValueChangeInsertion、NSKeyValueChangeRemoval、またはNSKeyValueChangeReplacementの値が指し示すのは、可変メッセージがキー値監視準拠コレクションプロキシに送信されたこと、またはキーに対するキー値コーディング準拠のコレクション変更メソッドの１つが発動されたこと、またはコレクションwill changeまたはdid changeメソッドがさもなければ発動されたことです。

source: A value of NSKeyValueChangeSetting indicates that the observed object has received a setValue:forKey: message, or that the key-value-coding-compliant set method for the key has been invoked, or that one of the willChangeValueForKey: or didChangeValueForKey: methods has otherwise been invoked.
ja: NSKeyValueChangeSettingの値が指し示すのは、監視されたオブジェクトがsetValue:forKey:メッセージを受け取ったこと、またはそのキーに対するキー値コーディング準拠の設定メソッドが発動されたこと、またはwillChangeValueForKey:もしくはdidChangeValueForKey:メソッドがさもなくば発動されたことです。

source: A value that changes as the user performs the gesture.
ja: ある値、それはユーザがジェスチャを実行するにつれて変化します。

source: A value that indicates how text instance aligns its lines when the content wraps or contains newlines.
ja: ある値、それは内容が改行を折り返すか抑制する場合にどのようにテキストインスタンスがそれの行を整列するかを指し示します。

source: A value that indicates how the layout truncates the last line of text to fit into the available space.
ja: ある値、それはどのようにレイアウトがテキストの最後の行を切り詰めて、利用可能な空間へとぴったり合わせるかを指し示します。

source: A value that indicates whether the scroll view displays the scrollable component of the content offset, in a way that’s suitable for the platform.
ja: ある値、それは、スクロールビューが、プラットホームに適しているある方法で、そのコンテンツオフセットのスクロール可能構成要素を表示するかどうかを指し示します。

source: A value that updates as the Digital Crown is rotated.
ja: ある値、それは「デジタルクラウン」が回されるにつれて更新されます。

source: A value that updates as the user rotates the Digital Crown.
ja: ある値、それはユーザが「デジタルクラウン」を回すにつれて更新されます。

source: A value that you use to left-, right-, or center-align the text within a view.
ja: ある値、それはあなたがビュー内のテキストを左、右、または中央揃えするのに使います。

source: A value to compare.
ja: 比較する値。

source: A value to monitor for changes.
ja: 変更を監視することになる値。

source: A value transformer can take inputs of one type and return a value of a different type.
ja: ある値変換器は、１つの型の入力を取り、そして異なる型の値を返すことが出来ます。

source: A value with a modifier applied to it.
ja: それに適用された修飾子をもつある値。

source: A version of the gesture that updates the provided state as the originating gesture’s value changes, and that resets the state to its initial value when the users cancels or ends the gesture.
ja: あるバージョンのジェスチャ、それは、提供されたstateを、起源を発しているジェスチャのもつ値が変化するにつれて更新するものです、そしてそれは、ユーザがジェスチャを取り消しまたは終わる時にstateをそれの初期値へと設定し直すものです。

source: A vertical offset you use to position the shadow relative to this view.
ja: このビューに相対して影の位置を定めるのにあなたが使う垂直オフセット（補う間隔）。

source: A view builder that creates the content of this stack.
ja: あるビュービルダー、それはこのスタックの内容を作成します。

source: A view builder that creates the view for a single row of the list.
ja: あるビュービルダー、それはリストの単一の行に対するビューを作成します。

source: A view for presenting a stack of views representing a visible path in a navigation hierarchy.
ja: ナビゲーション階層において、ある可視パスを表しているビューいくつかからなるあるスタックを提示するためのあるビュー。

source: A view modified so that its value for the given guide is the result of passing the ViewDimensions of the underlying view to computeValue.
ja: ある修正されたビュー、そうされたことで、それの値は与えられたガイドに対して、基礎をなすビューのViewDimensionsをcomputeValueに渡す結果になっています。

source: A view modified with respect to its horizontal alignment according to the computation performed in the method’s closure.
ja: あるビュー、それの水平整列に関してこのメソッドのもつクロージャにおいて実行される計算によって修正されたもの。

source: A view representing the appearance and interaction of a Toggle.
ja: あるToggleの外観と相互作用を表しているビュー。

source: A view shown on the trailing edge of the title.
ja: タイトルの末端で示されるビュー。

source: A view that activates this view as the source of a drag and drop operation, beginning with user gesture input.
ja: あるビュー、それはこのビューをドラッグ＆ドロップ操作のソースとして、ユーザジェスチャ入力で開始して活動します。

source: A view that adds a border with the specified style and width to this view.
ja: あるビュー、それは境界線をこの指定されたスタイルと幅でこのビューに加えたものです。

source: A view that adds a contextual menu to this view.
ja: あるビュー、それはあるコンテキスト（文脈）によるメニューをこのビューに加えたものです。

source: A view that adds a grayscale effect to this view.
ja: あるビュー、それはグレイスケール効果をこのビューに加えたものです。

source: A view that adds a shadow to this view.
ja: あるビュー、それはこのビューに影を加えたものです。

source: A view that adjusts the saturation of this view.
ja: あるビュー、それはこのビューの彩度を調整したものです。

source: A view that aligns the lines of multiline Text instances it contains.
ja: あるビュー、それはそれが含む複数行Textインスタンスの行それらを整列します。

source: A view that appears on the leading edge of the title.
ja: あるビュー、それはタイトルの先端で現れます。

source: A view that appears on the trailing edge of the title.
ja: あるビュー、それはタイトルの末端で現れます。

source: A view that applies animation to this view whenever value changes.
ja: あるビュー、それはanimationをこのビューにvalueが変化する時はいつでも適用するものです。

source: A view that applies blendMode to this view.
ja: あるビュー、それはblendModeをこのビューに適用するものです。

source: A view that applies a hue rotation effect to this view.
ja: あるビュー、それはある色相回転効果をこのビューに適用したものです。

source: A view that applies a luminance to alpha effect to this view.
ja: あるビュー、それは輝度をこのビューへのアルファ効果に適用したものです。

source: A view that applies color contrast to this view.
ja: あるビュー、それは色コントラストをこのビューに適用したものです。

source: A view that arranges its children in a horizontal line.
ja: あるビュー、それは、それの子らをある水平線に整列します。

source: A view that arranges its children in a vertical line.
ja: あるビュー、それは、それの子らをある垂直線に整列します。

source: A view that brightens this view by the specified amount.
ja: あるビュー、それはこのビューをその指定された量だけ明るくしたものです。

source: A view that calls action when elements are deleted from the original view.
ja: あるビュー、それはactionを要素が元のビューから削除される時に呼び出します。

source: A view that calls action when elements are inserted into the original view.
ja: あるビュー、それは要素が元のビューに挿入される時にactionを呼び出します。

source: A view that calls action when elements are moved within the original view.
ja: あるビュー、それは要素が元のビュー内で移動される時にactionを呼び出します。

source: A view that can compress the space between characters when necessary to fit text in a line.
ja: あるビュー、それはテキストを１行に収めるために必要な場合に文字間の空間を縮めることができます。

source: A view that clips this view to shape, using style to define the shape’s rasterization.
ja: あるビュー、このビューをshapeへと切り抜きます、styleを使って形状のもつラスタライゼーションを定義します。

source: A view that clips this view to its bounding frame.
ja: あるビュー、それはこのビューをそれの境界枠に切り抜いたものです。

source: A view that composites this view’s contents into an offscreen image before display.
ja: あるビュー、それはこのビューのもつ内容を画面外画像へと合成を、表示する前にするものです。

source: A view that conditionally flips its contents horizontally when the layout direction is right-to-left.
ja: あるビュー、それは条件付きでそれの内容を水平にフリップします、レイアウト方向が右から左である場合に。

source: A view that constrains this view’s dimensions to aspectRatio, using contentMode as its scaling algorithm.
ja: あるビュー、それはこのビューのもつ次元それらをaspectRatioに強制したものです、contentModeをそれの縮尺アルゴリズムとして使います。

source: A view that contains the Touch Bar content.
ja: あるビュー、それはTouch Bar内容を含みます。

source: A view that controls a navigation presentation.
ja: あるビュー、それはナビゲーション提示を制御します。

source: A view that controls whether users can interact with this view.
ja: あるビュー、それはユーザがこのビューと相互作用できるかどうかを制御したものです。

source: A view that describes the effect of calling onTrigger.
ja: あるビュー、それはonTriggerを呼び出すことの効果を記述するものです。

source: A view that describes the effect of calling the button’s action.
ja: あるビュー、それはボタンのもつアクションを呼び出す効果を記述します。

source: A view that describes the effect of pressing the button.
ja: あるビュー、それはボタンを押す効果を記述します。

source: A view that describes the effect of selecting the toggle.
ja: あるビュー、それはそのトグルを選択する効果を記述します。

source: A view that describes the purpose of the button’s action.
ja: あるビュー、それはボタンのもつactionの目的を記述します。

source: A view that describes the use of the selected color.
ja: あるビュー、それは選択された色の利用を記述します。

source: A view that displays an environment-dependent image.
ja: あるビュー、それはある環境依存の画像を表示します。

source: A view that displays one or more lines of read-only text.
ja: あるビュー、それは１行以上の読出し専用テキストを表示します。

source: A view that extends this view out of the safe area on the edges specified by edges.
ja: あるビュー、それはこのビューをedgesによって指定された縁上での安全領域の外に拡張したものです。

source: A view that fires an action when the specified value changes.
ja: あるビュー、それはあるアクションをこの指定された値が変化する時に開始します。

source: A view that fixes the center of this view at position.
ja: あるビュー、それはこのビューの中心をpositionに治したものです。

source: A view that fixes the center of this view at x and y.
ja: あるビュー、それはこのビューの中心をxとyに治したものです。

source: A view that fixes this view at its ideal size in the dimensions given in fixedDimensions.
ja: あるビュー、それはこのビューをfixedDimensionsで与えられた次元それらにおけるそれの最適な大きさに治します

source: A view that fixes this view at its ideal size in the dimensions specified by horizontal and vertical.
ja: あるビュー、それはこのビューをhorizontalとverticalで指定された次元それらにおけるそれの最適な大きさに治します

source: A view that inverts its colors.
ja: あるビュー、それの色を反転したものです。

source: A view that layers overlay in front of the view.
ja: あるビュー、それはoverlayをビューの前に重ねたものです。

source: A view that limits the amount of text downscaling.
ja: テキストを縮小する量を制限したあるビュー。

source: A view that limits the number of lines that Text instances display.
ja: あるビュー、それはTextインスタンスが表示する行数を制限します。

source: A view that may extend outside of the screen’s safe area on the edges specified by edges.
ja: あるビュー、それは画面のもつ安全領域の外側に、edgesによって指定された縁上で拡張するかもしれません。

source: A view that offsets this view by size.
ja: あるビュー、それはこのビューをsizeだけ補ったものです。

source: A view that offsets this view by x and y.
ja: あるビュー、それはこのビューをxとyだけ補ったものです。

source: A view that overlays its children, aligning them in both axes.
ja: あるビュー、それは、それの子らを上に重ねます、それらを両方の軸で整列しています。

source: A view that pads this view by the specified amount.
ja: あるビュー、それはこのビューをその指定された量だけ詰めものをしたものです。

source: A view that pads this view using edge the insets you specify.
ja: あるビュー、それはこのビューに縁を使ってあなたが指定する差込を詰め込みしたものです。

source: A view that pads this view using the specified edge insets.
ja: あるビュー、それはこのヒューにその指定された縁差込を使って詰めものをしたものです。

source: A view that provides a drop destination for a drag operation of the specified types.
ja: あるビュー、それは指定された型のドラッグ操作に対してドロップ目的地を提供するものです。

source: A view that represents a UIKit view controller.
ja: あるビュー、それはUIKitビューコントローラを表します。

source: A view that represents a UIKit view.
ja: あるビュー、それはUIKitビューを表します。

source: A view that represents a WatchKit interface object.
ja: WatchKitインターフェイスオブジェクトを表すビュー。

source: A view that represents an AppKit view controller.
ja: あるビュー、それはAppKitビューコントローラを表します。

source: A view that represents an AppKit view.
ja: あるビュー、それはあるAppKitビューを表します。

source: A view that represents the appearance and interaction of a toggle.
ja: あるビュー、それはあるトグルの外観と相互作用を表します。

source: A view that represents the body of a button with the bordered button style.
ja: あるビュー、それはボタンのもつボディを境界線付きボタンスタイルで表します。

source: A view that represents the body of a button with the borderless button style.
ja: あるビュー、それはボタンのボディを境界線なしボタンスタイルで表します。

source: A view that represents the body of a button with the default button style.
ja: あるビュー、それはボタンのボディを省略時のボタンスタイルで表します。

source: A view that represents the body of a button with the link button style.
ja: リンクボタンスタイルをもつボタンのボディを表すビュー。

source: A view that represents the body of a button with the plain button style.
ja: あるビュー、それはボタンのボディを素のボタンスタイルで表します。

source: A view that represents the body of a button.
ja: あるビュー、それはボタンのボディを表します。

source: A view that scales this view to fit its parent, maintaining this view’s aspect ratio.
ja: あるビュー、それはこのビューをそれの親にぴったり合うように拡大縮小したものです、このビューのもつアスペクト比を保っています。

source: A view that sets the transparency of this view.
ja: あるビュー、それはこのビューの透明度を設定したものです。

source: A view that sets this view’s color scheme.
ja: あるビュー、それはこのビューのもつカラースキームを設定したものです。

source: A view that sets whether a view is focusable, and triggers onFocusChange when the view gains or loses focus.
ja: あるビュー、それはビューがフォーカス可能であるかどうかを設定したものです、そしてonFocusChangeをビューがフォーカスを得るか失う時は引き起こします。

source: A view that shows a value within a range.
ja: あるビュー、それはある値をある範囲内で示します。

source: A view that shows or hides another content view, based on the state of a disclosure control.
ja: あるビュー、それは別のコンテンツビューを、ある開示コントロールの状態に基づき表示するまたは隠します。

source: A view that shows the progress towards completion of a task.
ja: あるビュー、それはあるタスクの完了に向けての進捗を示します。

source: A view that subscribes to a publisher with an action.
ja: あるビュー、それはあるパブリッシャーをアクションで購買します。

source: A view that switches between multiple child views using interactive user interface elements.
ja: あるビュー、それは複数の子ビューの間を切り替えます、対話式ユーザインターフェイス要素を使います。

source: A view that triggers action when the pointer enters and exits this view’s frame.
ja: あるビュー、それはポインタがこのビューのもつフレームに入るそして出る時にactionを引き起こします。

source: A view that triggers action when the value for key changes.
ja: あるビュー、それはactionをkeyに対する値が変化する時に引き起こしたものです。

source: A view that triggers action when this view appears.
ja: あるビュー、それはこのビューが現れる時にactionを引き起こすものです。

source: A view that triggers action when this view disappears.
ja: あるビュー、それはこのビューが姿を消す時にactionを引き起こすものです。

source: A view that truncates text at different points in a line depending on the mode you select.
ja: あるビュー、それはあなたが選択するモードに依存して、テキストをある行内の異なる地点それらで切り詰めたものです。

source: A view that wraps this view and applies animation to all animatable values used within the view.
ja: あるビュー、それはこのビューを包んで、animationをビュー内で使われる全てのアニメーション可能な値に適用します。

source: A view that wraps this view and applies transformation to all transactions used within the view.
ja: あるビュー、それはこのビューを包んでtransformationをビュー内で使われる全てのトランザクションに適用したものです。

source: A view that wraps this view in a compositing group.
ja: あるビュー、それはこのビューをある合成グループの中に包んだものです。

source: A view type that compares itself against its previous value and prevents its child updating if its new value is the same as its old value.
ja: あるビュー型、それはそれ自身をそれの前の値と比較して、それの新しい値がそれの古い値と同じならば、それの子を更新することを防ぎます。

source: A view with a color multiplication effect.
ja: ある色乗算効果でのあるビュー。

source: A view with fixed dimensions of width and height, for the parameters that are non-nil.
ja: widthとheightの治された次元それらを、非nilであるパラメータに対してもつビュー。

source: A view with flexible dimensions given by the call’s non-nil parameters.
ja: 呼び出しのもつ非nilパラメータによって与えられる柔軟な次元それらをもつあるビュー。

source: A view with multiple children automatically combines its values for a given preference into a single value visible to its ancestors.
ja: 複数の子をもつビューは、ある与えられた環境設定に対するそれの値を、それの先祖に可視の単一の値へと自動的に結合します。

source: A view with the default font set to the value you supply.
ja: あなたが提供する値に設定された省略時のフォントセットでのビュー。

source: A view’s size and its alignment guides in its own coordinate space.
ja: あるビューのもつ大きさとそれの整列ガイド、それ自身の座標空間におけるもの。

source: A visual element that can be used to separate other content.
ja: ある視覚的要素、それは他の内容を隔てるために使われることができます。

source: A way to turn a shape into a view.
ja: ある形状をビューへと変える方法。

source: A weight to use for fonts.
ja: フォントそれらに使うことになるウェイト。

source: A wrapped value for the gesture state property.
ja: ジェスチャ状態プロパティに対するラップされた値。

source: A wrapper for a UIKit view that you use to integrate that view into your SwiftUI view hierarchy.
ja: UIKitビューに対するラッパー、それはあなたがそのビューをあなたのSwiftUIビュー階層へと統合するために使用します。

source: A wrapper of the underlying environment object that can create bindings to its properties using dynamic member lookup.
ja: 基礎をなす環境オブジェクトのあるラッパー、それはバインディングをそれのプロパティに対して動的メンバー検索を使って作成できます。

source: A wrapper of the underlying observable object that can create bindings to its properties using dynamic member lookup.
ja: 基礎をなす監視可能オブジェクトのあるラッパー、それはバインディングをそれのプロパティに対して動的メンバー検索を使って作成できます。

source: A wrapper that you use to integrate an AppKit view controller into your SwiftUI interface.
ja: あるラッパー、それはあなたがあるAppKitビューコントローラをあなたのSwiftUIインターフェイスへと統合するために使用します。

source: A wrapper that you use to integrate an AppKit view into your SwiftUI view hierarchy.
ja: あるラッパー、それはあなたがあるAppKitビューをあなたのSwiftUIビュー階層へと統合するために使用します。

source: Acceptable child nodes are instances of the XMLDTDNode class as well as XMLNode objects representing comment nodes and processing-instruction nodes.
ja: 受け入れ可能な子ノードは、XMLDTDNodeクラスのインスタンス、それだけでなくコメントノードと処理命令ノードを表しているXMLNodeオブジェクトです。

source: Access Other Environment Values
ja: 他の環境値にアクセスする

source: Access the Undo Manager
ja: アンドゥマネージャにアクセスする

source: Access view preferences and provide child views with configuration data.
ja: ビュー環境設定にアクセスします、そして子ビューを構成設定されたデータで提供します。

source: Accesses a contiguous subrange of the collection’s elements.
ja: コレクションのもついくらかの要素からなるある連続した下位範囲にアクセスします。

source: Accesses the contiguous subrange of the collection’s elements specified by a range expression.
ja: 範囲式によって指定される、コレクションの要素からなる連続した下位範囲にアクセスします。

source: Accessibility
ja: アクセシビリティ

source: Accessibility Modifier Types
ja: アクセシビリティ修飾子型
